export const ProjectData=[
    {
        id:1,
        title:"⚒️ CONTRANEER",
        about:"เป็น game clone ของ contra | หน้าที่ที่ได้รับมอบหมายก็จะเป็นงาน art, level design, การเพิ่ม hud  เข้าไปในเกม ui ต่างๆของเกม ",
        tags:["Scratch"],
        demo:"https://scratch.mit.edu/projects/331398730/fullscreen/",
        image:"https://cdn.discordapp.com/attachments/695906006240067607/913025870338338866/pj1.png"
    },

    {
        id:2,
        title:"🏥 POST OPERATIVE CARE",
        about:"เป็นการทำโปรแกรมดูแลคนไข้หลังการผ่าตัด ที่คนไข้จะเข้ามาดูข้อมูลการดูแลตัวเองหลังจากการผ่าตัด โดยคุณหมอจะสามารถเข้ามาดูข้อมูลของคนไข้คนนั้นๆ ของตัวเองได้ | หน้าที่ที่ผมได้รับคือการ encrypt password ของผู้ใช้ครับ การเชื่อมต่อไปยังหน้าต่างๆ รวมถึงการทำ UI ของโปรแกรม",
        tags:["C++", "GUI"],
        github:"https://github.com/post-operative-care/GUI",
        github2:"https://github.com/post-operative-care/MAIN",
        image: "https://avatars.githubusercontent.com/u/62207744?s=200&v=4"
    },

    {
        id:3,
        title:"⚒️ JANABI",
        about:"JANABI เป็น game clone ของ contra ที่ต่อยอดมาจากเกมที่เขียนใน SCRATCH ครับ แต่คราวนี้เขียนด้วย JAVA ที่สามารถทำอะไรได้มากกว่าและเขียนได้ซับซ้อนกว่า ในงานนี้ผมได้รับหน้าที่ในการเขียน UI ของเกม รวมถึงงาน art การออกแบบตัวละครส่วนใหญ่ ด่าน อาวุธ ต่างๆ",
        tags:["JAVA", "OOP"],
        github:"https://github.com/Harksom-Dev/JANNABI",
        image: "https://cdn.discordapp.com/attachments/695906006240067607/913036983293587496/pj2.png"
    },
    {
        id:4,
        title:"🖥️ ระบบ POS",
        about:"ในโปรเจคนี้งานที่ได้รับมอบหมายจะเป็นการทำหน้าจัดการลูกค้า, พนักงาน โดยดึงข้อมูลมาจาก Database| โดยหน้าจัดการลูกค้า สามารถเพิ่มลูกค้า มีการแก้ไขข้อมูลส่วนตัว การเลือกที่อยู่หลักของลูกค้า(ในกรณีที่ลูกค้ามีหลายที่อยู่), หน้าจัดการพนักงาน พนักงานที่มี Role เป็นผู้จัดการสามารถสามารถเลื่อนขั้นพนักงานคนอื่นๆ ได้ รวมถึงสามารถเพิ่มหนักงานใหม่เข้ามาได้",
        tags:["PHP", "SQL", "HTML", "LARAVEL"],
        github:"https://github.com/Harksom-Dev/Database-Project",
        image: "https://cdn.discordapp.com/attachments/695906006240067607/914222873013543002/pj.png"
    },
    {
        id:5,
        title:"💖 FINDER ",
        about:"เป็น Project ที่อยู่ระหว่างการพัฒนาใน sprint แรก เป็น mobile app ที่คล้ายๆ กับแอปพลิเคชันชื่อดังอย่าง Tinder โดยจะเป็นแอปพลิเคชันที่มีเป้าหมายในการสร้างการติดต่อสื่อสารเพื่อเพิ่มการมีปฏิสัมพันธ์ของนักศึกษาวิศวกรรมคอมพิวเตอร์ของมหาวิทยาลัยเชียงใหม่ ในช่วง COVID-19 ที่เราไม่สามารถไปเจอกัน หรือ เรียน On-Site ได้ | หน้าที่ที่ได้รับก็จะเป็น Designer และ Front End Developer สามารถดูข้อมูลเพิ่มเติมได้ที่เว็บไซต์ทีมของผม  hz-team.blogspot.com",
        tags:["FLUTTER", "DART", "MOBILE APP"],
        image: "https://blogger.googleusercontent.com/img/a/AVvXsEhrKmAgLv2D24BdKV_RIaI9ccaz1YT_imNTaWgDGzs7MK-oZYDfbzq8Vsfq0qh943rvyydakCgTXH7ZTl7-pB3ELPbRk4DLob6hb9K4IudS6WoVN9iUfBePwrOfJYewh7jcFIel-I2QsblwTcCYtX2QSj2vmgTHj--WHzTlR1TICdVUN9S-5owT5Hohxw=w200-h200"
    }
]